DataProcessors/ПанельАдминистрированияИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияИСМП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПанельАдминистрированияИСМП/Forms/НастройкаИсключений/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеВыделеннойОбласти;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементКонструктора = Параметры.ЭлементКонструктора;
	Если Не ЗначениеЗаполнено(ЭлементКонструктора) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	Заголовок = Строка(ЭлементКонструктора);
	
	ЦветФонаИзмененногоЗначения = ЦветаСтиля.ЦветФонаИзмененногоЗначенияГосИС;
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	СтрокаПримечания = 0;
	
	ПолучитьПараметрыЭлементаКонструктора();
	ВыполнитьЗаполнениеДанныхНаСервере();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененныеДанные.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросЗаписатьДанныеПередЗакрытием", ЭтотОбъект),
			НСтр("ru = 'В таблице присутствуют измененные данные. При закрытии формы изменения будут утеряны.
				|Выполнить запись измененных данных перед закрытием формы?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)
	
	ПодключитьОбработчикОжидания("ВыделитьТекущуюОбласть", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыделеннуюОбласть(Область);
	УстановитьДоступностьЗаписиДанных(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ИзмененныеДанные.Количество() = 0 Тогда
		ВыполнитьЗаполнениеДанных();
	Иначе
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросЗаписатьДанныеПередЗаполнением", ЭтотОбъект),
			НСтр("ru = 'В таблице присутствуют измененные данные. При заполнении изменения будут утеряны.
				|Выполнить запись измененных данных перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ВыполнитьЗаписьДанных();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочие

&НаКлиенте
Процедура ВопросЗаписатьДанныеПередЗаполнением(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьДанных();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ВыполнитьЗаполнениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаписатьДанныеПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьДанных(Ложь);
		ИзмененныеДанные.Очистить();
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ИзмененныеДанные.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеДанных()
	
	ОчиститьСообщения();
	ВыполнитьЗаполнениеДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьДанных(ВыполнятьЗаполнение = Истина)
	
	ОчиститьСообщения();
	ВыполнитьЗаписьДанныхНаСервере(ВыполнятьЗаполнение);
	УстановитьДоступностьЗаписиДанных(ЭтотОбъект);
	Оповестить("ИзменениеДанныхКонструктораВидовПродукцииИС",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЗаписиДанных(Форма)
	
	Форма.Элементы.ФормаЗаписатьИЗакрыть.Доступность = Форма.ИзмененныеДанные.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьТекущуюОбласть()
	
	ОбщегоНазначенияИСКлиент.ВыделитьТекущуюОбласть(ТабличныйДокумент, ДанныеВыделеннойОбласти);
	
	ВывестиПримечание();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, НовоеЗначение = Неопределено)
	
	ЕстьДанныеДляОбработки = Ложь;
	
	Для НомерСтроки = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
		Для НомерКолонки = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
			
			Область = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Если ТипЗнч(Область.Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			КлючЭлементаДанных = Область.Расшифровка;
			ЭлементДанных = Данные.Получить(КлючЭлементаДанных);
			Если ЭлементДанных = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НовоеЗначение = Неопределено Тогда
				ЕстьДанныеДляОбработки = Истина;
				Если ЭлементДанных.ТекущийИндексКартинки <> 1 Тогда
					ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, Истина);
					Возврат;
				КонецЕсли;
			Иначе
				ТекущийИндексКартинки = ЭлементДанных.ТекущийИндексКартинки;
				Если НовоеЗначение Тогда
					ТекущийИндексКартинки = 1;
				Иначе
					Если ЭлементДанных.ТекущийИндексКартинки = 1 Тогда
						Если ЭлементДанных.ЕстьСвязанныйЭлемент Тогда
							Если Не ЗначениеЗаполнено(ЭлементДанных.ЗначениеСвязанногоЭлемента) Тогда
								ТекущийИндексКартинки = 0;
							ИначеЕсли ТекущаяДата < ЭлементДанных.ЗначениеСвязанногоЭлемента Тогда
								ТекущийИндексКартинки = 2;
							КонецЕсли;
						Иначе
							ТекущийИндексКартинки = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ЭлементДанных.ТекущийИндексКартинки <> ТекущийИндексКартинки Тогда
					ЭлементДанных.ТекущийИндексКартинки = ТекущийИндексКартинки;
					ЭлементИзмененныхДанных = ИзмененныеДанные.НайтиПоЗначению(КлючЭлементаДанных);
					Если ЭлементДанных.ИндексКартинки = ЭлементДанных.ТекущийИндексКартинки Тогда
						Область.ЦветФона = Новый Цвет;
						Если ЭлементИзмененныхДанных <> Неопределено Тогда
							ИзмененныеДанные.Удалить(ЭлементИзмененныхДанных);
						КонецЕсли;
					Иначе
						Область.ЦветФона = ЦветФонаИзмененногоЗначения;
						Если ЭлементИзмененныхДанных = Неопределено Тогда
							ИзмененныеДанные.Добавить(КлючЭлементаДанных);
						КонецЕсли;
					КонецЕсли;
					Если ЭлементДанных.ТекущийИндексКартинки = 1 Тогда
						Область.Картинка = БиблиотекаКартинок.УспешнаяПроверкаНаличияГосИС;
					ИначеЕсли ЭлементДанных.ТекущийИндексКартинки = 2 Тогда
						Область.Картинка = БиблиотекаКартинок.ПодтвердитьПолучениеГосИС;
					Иначе
						Область.Картинка = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьДанныеДляОбработки Тогда
		ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПримечание()
	
	Если ТабличныйДокумент.ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаПримечания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТабличныйДокумент.ТекущаяОбласть.Верх = 0
		И ТабличныйДокумент.ТекущаяОбласть.Низ = 0
		И ТабличныйДокумент.ТекущаяОбласть.Лево = 0
		И ТабличныйДокумент.ТекущаяОбласть.Право = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Примечание = "";
	Если ТабличныйДокумент.ТекущаяОбласть.Верх = ТабличныйДокумент.ТекущаяОбласть.Низ
		И ТабличныйДокумент.ТекущаяОбласть.Лево = ТабличныйДокумент.ТекущаяОбласть.Право Тогда
		
		Область = ТабличныйДокумент.Область(ТабличныйДокумент.ТекущаяОбласть.Верх, ТабличныйДокумент.ТекущаяОбласть.Лево);
		Если ТипЗнч(Область.Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
			ЭлементДанных = Данные.Получить(Область.Расшифровка);
			Если ЭлементДанных <> Неопределено
				И ЭлементДанных.ЕстьСвязанныйЭлемент
				И ЗначениеЗаполнено(ЭлементДанных.ЗначениеСвязанногоЭлемента) Тогда
				Если ТекущаяДата < ЭлементДанных.ЗначениеСвязанногоЭлемента Тогда
					Если ЭлементДанных.ТекущийИндексКартинки = 1 Тогда
						Если ЭлементДанных.ЗначениеПоУмолчанию = Истина Тогда
							Примечание = СтрШаблон(
								НСтр("ru = 'Контроль включен. Настройка ""по умолчанию"" по дате ""%1"" с %2.'"),
								ЭлементДанных.ПредставлениеСвязанногоЭлемента,
								Формат(ЭлементДанных.ЗначениеСвязанногоЭлемента, "ДФ=dd.MM.yyyy;"));
						Иначе
							Примечание = СтрШаблон(
								НСтр("ru = 'Контроль включен пользователем. Настройка ""по умолчанию"" по дате ""%1"" с %2.'"),
								ЭлементДанных.ПредставлениеСвязанногоЭлемента,
								Формат(ЭлементДанных.ЗначениеСвязанногоЭлемента, "ДФ=dd.MM.yyyy;"));
						КонецЕсли;
					Иначе
						Примечание = СтрШаблон(
							НСтр("ru = 'Контроль начнет действовать по дате ""%1"" с %2.'"),
							ЭлементДанных.ПредставлениеСвязанногоЭлемента,
							Формат(ЭлементДанных.ЗначениеСвязанногоЭлемента, "ДФ=dd.MM.yyyy;"));
					КонецЕсли;
				Иначе
					Примечание = СтрШаблон(
						НСтр("ru = 'Контроль действует по дате ""%1"" с %2.'"),
						ЭлементДанных.ПредставлениеСвязанногоЭлемента,
						Формат(ЭлементДанных.ЗначениеСвязанногоЭлемента, "ДФ=dd.MM.yyyy;"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(СтрокаПримечания, 1);
	Область.Текст = Примечание;
	
КонецПроцедуры

#КонецОбласти

#Область СКД

&НаСервере
Процедура ВыполнитьЗаполнениеДанныхНаСервере()
	
	ТаблицаСвязанныхЭлементов = Новый ТаблицаЗначений;
	ТаблицаСвязанныхЭлементов.Колонки.Добавить("ВидПродукции",        Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ТаблицаСвязанныхЭлементов.Колонки.Добавить("Значение",            ПараметрыЭлементаКонструктора.ТипЗначения);
	ТаблицаСвязанныхЭлементов.Колонки.Добавить("СвязанныйЭлемент",    Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	ТаблицаСвязанныхЭлементов.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов("Булево"));
	
	ИспользуетсяСвязанныйЭлемент = ИспользуетсяСвязанныйЭлемент(ПараметрыЭлементаКонструктора);
	
	Если ИспользуетсяСвязанныйЭлемент Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭлементКонструктора", ЭлементКонструктора);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции
		|ПОМЕСТИТЬ ВидыПродукции
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|ГДЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
		|	И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|ИЗ
		|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|ГДЕ
		|	ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
		|	И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
		|	ЗначенияЭлементовКонструктора.Значение КАК Значение,
		|	ЗначенияЭлементовКонструктора.Атрибуты КАК Атрибуты
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыПродукции КАК ВидыПродукции
		|		ПО ЗначенияЭлементовКонструктора.ВидПродукции = ВидыПродукции.ВидПродукции
		|ГДЕ
		|	ЗначенияЭлементовКонструктора.ЭлементКонструктора = &ЭлементКонструктора";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Атрибуты = Выборка.Атрибуты.Получить();
			Если ТипЗнч(Атрибуты) = Тип("Структура")
				И Атрибуты.Свойство("СвязанныйЭлемент")
				И ЗначениеЗаполнено(Атрибуты.СвязанныйЭлемент) Тогда
				Строка = ТаблицаСвязанныхЭлементов.Добавить();
				Строка.ВидПродукции = Выборка.ВидПродукции;
				Строка.Значение = Выборка.Значение;
				Строка.СвязанныйЭлемент = Атрибуты.СвязанныйЭлемент;
				Строка.ЗначениеПоУмолчанию = ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.КонтролироватьСтатусыКодовМаркировки;
				Если Атрибуты.Свойство("ВключенДоДатыДействияСвязанногоЭлемента") Тогда
					Если Атрибуты.ВключенДоДатыДействияСвязанногоЭлемента = Истина Тогда
						Строка.ЗначениеПоУмолчанию = Истина;
					КонецЕсли;
				ИначеЕсли Атрибуты.Свойство("ВыключенДоДатыДействияСвязанногоЭлемента") Тогда
					Если Атрибуты.ВыключенДоДатыДействияСвязанногоЭлемента = Истина Тогда
						Строка.ЗначениеПоУмолчанию = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанных();
	
	Если Не ИспользуетсяСвязанныйЭлемент Тогда
		Для Каждого ЭлементСтруктурыНастроек Из СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Структура Цикл
			Если ЭлементСтруктурыНастроек.Имя = "Легенда" Тогда
				ЭлементСтруктурыНастроек.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
	Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЭлементКонструктора", ЭлементКонструктора);
	Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата);
	Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТаблицаСвязанныхЭлементов", ТаблицаСвязанныхЭлементов);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(), ДанныеРасшифровки,,
		Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СформироватьДанныеИзРасшифровки(ДанныеРасшифровки);
	ОпределитьОбластьПримечания();
	
	ИзмененныеДанные.Очистить();
	
	УстановитьДоступностьЗаписиДанных(ЭтотОбъект);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыЭлементаКонструктора()
	
	ПараметрыЭлементаКонструктора = Новый ФиксированнаяСтруктура(
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(ЭлементКонструктора));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИспользуетсяСвязанныйЭлемент(ПараметрыЭлементаКонструктора)
	
	Возврат ПараметрыЭлементаКонструктора.ИспользоватьАтрибуты
		И ПараметрыЭлементаКонструктора.Атрибуты.Свойство("СвязанныйЭлемент");
	
КонецФункции

&НаСервере
Функция ПолучитьСхемуКомпоновкиДанных()
	
	Возврат Обработки.ПанельАдминистрированияИСМП.ПолучитьМакет("НастройкаИсключений");
	
КонецФункции

&НаСервере
Процедура СформироватьДанныеИзРасшифровки(ДанныеРасшифровки)
	
	Результат = Новый Соответствие;
	
	Для Каждого ЭлементДанныхРасшифровки Из ДанныеРасшифровки.Элементы Цикл
		Если ТипЗнч(ЭлементДанныхРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ЗначенияПолей = ЭлементДанныхРасшифровки.ПолучитьПоля();
			Если ЗначенияПолей.Количество() > 0
				И ЗначенияПолей.Найти("ИндексКартинки") <> Неопределено Тогда
				ЭлементДанных = Новый Структура;
				Для Каждого ЗначениеПоля Из ЗначенияПолей Цикл
					ЭлементДанных.Вставить(ЗначениеПоля.Поле, ЗначениеПоля.Значение);
				КонецЦикла;
				ЭлементДанных.Вставить("ТекущийИндексКартинки", ЭлементДанных.ИндексКартинки);
				Результат.Вставить(ЭлементДанныхРасшифровки.Идентификатор, ЭлементДанных);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Данные = Новый ФиксированноеСоответствие(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьОбластьПримечания()
	
	СтрокаПримечания = 0;
	
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Область = ТабличныйДокумент.Область(НомерСтроки, 1);
		Если Область.Текст = "" И Область.Картинка <> Неопределено Тогда
			СтрокаПримечания = НомерСтроки - 1;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДанных

&НаСервере
Процедура ВыполнитьЗаписьДанныхНаСервере(ВыполнятьЗаполнение)
	
	Таблица = РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ИнициализироватьТаблицуДанных();
	
	Для Каждого ЭлементИзмененныхДанных Из ИзмененныеДанные Цикл
		ЭлементДанных = Данные.Получить(ЭлементИзмененныхДанных.Значение);
		Если ЭлементДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УдалениеЗначенияПользователя = ЭлементДанных.ТекущийИндексКартинки = 1
			И ЭлементДанных.ИндексКартинки = 0
			И ЭлементДанных.ЕстьЗначениеПользователя;
		Строка = Таблица.Добавить();
		Строка.ЭлементКонструктора = ЭлементКонструктора;
		Строка.ВидПродукции        = ЭлементДанных.ВидПродукции;
		Строка.Значение            = ЭлементДанных.Значение;
		Строка.Параметризуется     = ПараметрыЭлементаКонструктора.Параметризуется;
		Строка.ЗначениеУстановлено = ЭлементДанных.ТекущийИндексКартинки = 1;
		Строка.ОчиститьАтрибуты    = ЭлементДанных.ЕстьСвязанныйЭлемент И Не УдалениеЗначенияПользователя;
		Строка.КаждомуВидуПродукцииСоответствуетОдноЗначение = ПараметрыЭлементаКонструктора.КаждомуВидуПродукцииСоответствуетОдноЗначение;
	КонецЦикла;
	
	РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ЗаписатьДанные(Таблица);
	
	ИзмененныеДанные.Очистить();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ВыполнятьЗаполнение Тогда
		ВыполнитьЗаполнениеДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
